#+TITLE: Raspberry Pi Zero 2 W Gateway for SunPower PVS5 with TLS Termination
#+AUTHOR: Jeff Kowalski
#+DATE: 2025-10-19
#+PROPERTY: header-args :tangle yes :mkdirp yes
#+OPTIONS: toc:2 num:t

** Query all variables which match a substring and output as an object
#+BEGIN_SRC shell
curl -s \
     -k \
     -b cookies.txt \
     -c cookies.txt \
     "https://$ip/vars?match=rev&fmt=obj" | jq -M
#+END_SRC

#+RESULTS:
#+begin_example
{
  "values": [
    {
      "name": "/sys/info/hwrev",
      "value": "3.3"
    },
    {
      "name": "/sys/info/fwrev",
      "value": "TBD"
    },
    {
      "name": "/sys/info/sw_rev",
      "value": "0.0.25.5408"
    }
  ],
  "count": 3
}
#+end_example

Expected
#+BEGIN_EXAMPLE
{
  "/sys/info/hwrev": "6.03",
  "/sys/info/fwrev": " Major 2, Revision 0x00000001, Build 3",
  "/sys/info/sw_rev": "2025.06.24.61840"
}
#+END_EXAMPLE
** Query firmware version and MAC address
#+BEGIN_SRC shell
curl -s -k \
  -b cookies.txt \
  -c cookies.txt \
  "https://$ip/vars?name=/sys/info/model,/sys/info/hwrev,/sys/info/fwrev,/sys/info/sw_rev" | jq -M
#+END_SRC

#+RESULTS:
#+begin_example
{
  "values": [
    {
      "name": "/sys/info/model",
      "value": "PVS5"
    },
    {
      "name": "/sys/info/hwrev",
      "value": "3.3"
    },
    {
      "name": "/sys/info/fwrev",
      "value": "TBD"
    },
    {
      "name": "/sys/info/sw_rev",
      "value": "0.0.25.5408"
    }
  ],
  "count": 4
}
#+end_example

